Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КостюмыИзолирующие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдеждаСпециальнаяЗащитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваДерматологическиеЗащитные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыГлаз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыГоловы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыКомплексные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыНог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыОргановДыхания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыОргановСлуха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыОтПадения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваЗащитыРук</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНоменклатуры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает текст подсказки по типу номенклатуры
//
// Параметры:
//  ТипНоменклатуры	 - ПеречислениеСсылка.ТипыНоменклатуры	 - тип номенклатуры.
// 
// Возвращаемое значение:
//  Строка - подсказка по типу номенклатуры.
//
Функция ПодсказкаПоТипуНоменклатуры(ТипНоменклатуры) Экспорт
	
	Если ТипНоменклатуры = КостюмыИзолирующие Тогда
		Возврат НСтр("ru = 'Используются в экстремальных, аварийных ситуациях, создают защиту в случае наличия биологических или химических факторов, увеличения в воздухе количества радиоактивных веществ, неблагоприятной температуры воздуха в зоне проведения работ.'");
	ИначеЕсли ТипНоменклатуры = ОдеждаСпециальнаяЗащитная Тогда
		Возврат НСтр("ru = 'Специальная одежда (накидки, халаты, комбинезоны, жилеты и др.) отличается различными защитными свойствами, направленными против механических воздействий, электричества, нефтепродуктов, токсичных веществ и прочих вредных факторов.'");
	ИначеЕсли ТипНоменклатуры = СредстваДерматологическиеЗащитные Тогда
		Возврат НСтр("ru = 'В зависимости от назначения подразделяются на защитные, очистители кожи и репаративные. Как правило это крема, мази, лосьоны и другие препараты.'");
	ИначеЕсли ТипНоменклатуры = СредстваЗащитыГлаз Тогда
		Возврат НСтр("ru = 'Маски, очки защитные, щитки. Их задача заключается в защите органов зрения от жидкостей, твердых частиц, пыли, газов, слепящего света, излучений.'");
	ИначеЕсли ТипНоменклатуры = СредстваЗащитыГоловы Тогда
		Возврат НСтр("ru = 'Защитные каски, подшлемники, шлемы, шапки, косынки и прочие головные уборы.'");
	ИначеЕсли ТипНоменклатуры = СредстваЗащитыКомплексные Тогда
		Возврат НСтр("ru = 'Комплексные СИЗ предохраняют одновременно от ряда факторов опасности.'");
	ИначеЕсли ТипНоменклатуры = СредстваЗащитыЛица Тогда
		Возврат НСтр("ru = 'В качестве СИЗ для лица и глаз применяются лицевые защитные щитки, которые крепятся к каске, надеваются на голову или оснащены ручкой. Щитки защищают лицо от повреждений твердыми частицами, от брызг, искр раскаленного металла, кислот, щелочи, от различных типов излучений.'");
	ИначеЕсли ТипНоменклатуры = СредстваЗащитыНог Тогда
		Возврат НСтр("ru = 'Специальная обувь из кожи, полимерных материалов или валяная, обеспечивающая безопасность ног от механических влияний, электричества, скольжения, кислотных и щелочных растворов, статистических нагрузок.'");
	ИначеЕсли ТипНоменклатуры = СредстваЗащитыОргановДыхания Тогда
		Возврат НСтр("ru = 'Подразделяются на изолирующие или фильтрующие. Фильтрующие средства запрещены к применению при проведении работ в колодцах, внутри емкостей, при наличии в воздухе химических загрязнений неизвестной консистенции и состава.'");
	ИначеЕсли ТипНоменклатуры = СредстваЗащитыОргановСлуха Тогда
		Возврат НСтр("ru = 'Зависят от степени шума в рабочей зоне. Представлены противошумными наушниками, шлемами, берушами (вкладышами).'");
	ИначеЕсли ТипНоменклатуры = СредстваЗащитыОтПадения Тогда
		Возврат НСтр("ru = 'Позволяют создать безопасные условия проведения высотных работ и обеспечить своевременную эвакуацию из зоны риска.'");
	ИначеЕсли ТипНоменклатуры = СредстваЗащитыРук Тогда
		Возврат НСтр("ru = 'Перчатки, рукавицы, наладонники, налокотники и др. СИЗ для рук позволяют защитить части рук от вредного воздействия, в т.ч. механического, химического, биологического.'");
	Иначе
		Возврат НСтр("ru = 'Определяет возможности по учету номенклатуры в различных механизмах'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
